02_Modelagem_UML_Astah/UC04_Gerenciar_Perfis_Acessos/UC04_Sequencia.puml
@startuml
skinparam monochrome true
autonumber
participant A as ":Admin"
participant M as ":GerenciadorAcesso"
participant U as ":Usuario"
A -> M : alterarPapel(id, papel)
activate M
M -> U : setPapel(papel)
U --/ M : ok
M --/ A : Sucesso
deactivate M
@enduml
